/*
【数组逆序重放】
来源: POJ
注意：总时间限制: 1000ms 内存限制: 65536kB
描述：将一个数组中的值按逆序重新存放。
      例如，原来的顺序为8,6,5,4,1。要求改为1,4,5,6,8。
输入：输入为两行：第一行数组中元素的个数n（1<n<100)，
      第二行是n个整数，每两个整数之间用空格分隔
输出：输出逆序后数组的整数，每两个整数之间用空格分隔。
*/
#include <iostream>
using namespace std;

int arrayReverse(){
    int n,a[100];
    cin >> n;
    //int n,*a;
    //cin >> n;
    //a = new int[n];
    for(int i = 0; i<n; i++)
        cin >> a[i];
    while(n--){//常用的倒序计数循环，等价于while(n-->0)
        cout << a[n];
        if (n > 0) cout << " "; //如果不是最后一个数那么就要用空格分隔开
    }
    cout<<endl;
    return 0;
}
//这道题的解法就是反复地除以2，看最低位是1还是0。
//有些知道位运算的同学喜欢用位运算，但其实没必要，因为编译器优化之后的程序其实效率是一样的
